test/fixtures/refund_tokenized_payment.yml

---
http_interactions:
- request:
    method: get
    uri: https://imagerelay-staging.chargeover.com/api/v3/transaction/145
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.1
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - ! '*/*'
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 05 May 2015 18:07:58 GMT
      Server:
      - Apache
      X-Chargeover-Sandbox:
      - '0'
      X-Chargeover-Env:
      - ! '?'
      X-Chargeover-Account:
      - be28f27091ae27759f6e32f79616aa11
      X-Chargeover-Admin:
      - '0'
      X-Chargeover-User:
      - '0'
      Content-Length:
      - '782'
      Content-Type:
      - application/json
    body:
      encoding: US-ASCII
      string: ! "{\n  \"code\":200,\n  \"status\":\"OK\",\n  \"message\":\"\",\n  \"response\":{\n
        \   \"transaction_id\":145,\n    \"gateway_id\":202,\n    \"currency_id\":1,\n
        \   \"external_key\":null,\n    \"token\":\"rxkv3jg85co9\",\n    \"transaction_date\":\"2015-05-02\",\n
        \   \"gateway_status\":1,\n    \"gateway_transid\":\"ch_6AKJG0lVR0z18B\",\n
        \   \"gateway_msg\":\"\",\n    \"amount\":104.94,\n    \"fee\":-3.34,\n    \"transaction_type\":\"pay\",\n
        \   \"transaction_method\":\"Visa\",\n    \"transaction_detail\":\"x4242\",\n
        \   \"transaction_datetime\":\"2015-05-02 07:23:34\",\n    \"transaction_ipaddr\":\"206.196.34.77\",\n
        \   \"void_datetime\":null,\n    \"transaction_type_name\":\"Payment\",\n
        \   \"currency_symbol\":\"$\",\n    \"currency_iso4217\":\"USD\",\n    \"customer_id\":38,\n
        \   \"applied_to\":[\n      {\n        \"invoice_id\":10105,\n        \"applied\":104.94\n
        \     }\n    ]\n  }\n}"
    http_version: 
  recorded_at: Tue, 05 May 2015 18:08:11 GMT
- request:
    method: post
    uri: https://imagerelay-staging.chargeover.com/api/v3/transaction/145?action=refund
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.1
      Content-Type:
      - application/json
      Content-Length:
      - '0'
      Accept:
      - ! '*/*'
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 05 May 2015 18:07:58 GMT
      Server:
      - Apache
      X-Chargeover-Sandbox:
      - '0'
      X-Chargeover-Env:
      - ! '?'
      X-Chargeover-Account:
      - be28f27091ae27759f6e32f79616aa11
      X-Chargeover-Admin:
      - '0'
      X-Chargeover-User:
      - '0'
      Content-Length:
      - '84'
      Content-Type:
      - application/json
    body:
      encoding: US-ASCII
      string: ! "{\n  \"code\":200,\n  \"status\":\"OK\",\n  \"message\":\"\",\n  \"response\":{\n
        \   \"id\":\"155\"\n  }\n}"
    http_version: 
  recorded_at: Tue, 05 May 2015 18:08:13 GMT
- request:
    method: get
    uri: https://imagerelay-staging.chargeover.com/api/v3/transaction/155
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.1
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - ! '*/*'
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 05 May 2015 18:08:00 GMT
      Server:
      - Apache
      X-Chargeover-Sandbox:
      - '0'
      X-Chargeover-Env:
      - ! '?'
      X-Chargeover-Account:
      - be28f27091ae27759f6e32f79616aa11
      X-Chargeover-Admin:
      - '0'
      X-Chargeover-User:
      - '0'
      Content-Length:
      - '779'
      Content-Type:
      - application/json
    body:
      encoding: US-ASCII
      string: ! "{\n  \"code\":200,\n  \"status\":\"OK\",\n  \"message\":\"\",\n  \"response\":{\n
        \   \"transaction_id\":155,\n    \"gateway_id\":202,\n    \"currency_id\":1,\n
        \   \"external_key\":null,\n    \"token\":\"a6cbwpi3sx1o\",\n    \"transaction_date\":\"2015-05-05\",\n
        \   \"gateway_status\":1,\n    \"gateway_transid\":\"ch_6AKJG0lVR0z18B\",\n
        \   \"gateway_msg\":\"\",\n    \"amount\":-104.94,\n    \"fee\":0,\n    \"transaction_type\":\"ref\",\n
        \   \"transaction_method\":\"Visa\",\n    \"transaction_detail\":\"x4242\",\n
        \   \"transaction_datetime\":\"2015-05-05 13:08:00\",\n    \"transaction_ipaddr\":\"70.88.244.230\",\n
        \   \"void_datetime\":null,\n    \"transaction_type_name\":\"Refund\",\n    \"currency_symbol\":\"$\",\n
        \   \"currency_iso4217\":\"USD\",\n    \"customer_id\":38,\n    \"applied_to\":[\n
        \     {\n        \"invoice_id\":10105,\n        \"applied\":-104.94\n      }\n
        \   ]\n  }\n}"
    http_version: 
  recorded_at: Tue, 05 May 2015 18:08:14 GMT
recorded_with: VCR 2.9.3
